app/controllers/api/branches_controller.rb

  def create
    branch = Branch.new(branch_params)
    if branch.save
---
INSERT INTO "branches" ("name", "organization_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "test branch"], ["organization_id", 1], ["created_at", "2023-11-18 05:52:32.385286"], ["updated_at", "2023-11-18 05:52:32.385286"]]