app/controllers/api/organizations_controller.rb

    def index
      @organizations = Organization.all
---
SELECT "organizations".* FROM "organizations"

    def create
      organization = Organization.new(organization_params)
      if organization.save
---
INSERT INTO "organizations" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "test organization"], ["created_at", "2023-11-14 14:54:23.675292"], ["updated_at", "2023-11-14 14:54:23.675292"]]