app/controllers/api/patients_controller.rb

  def index
    @patients = Patient.all
---
SELECT "patients".* FROM "patients"

  def create
    patient = Patient.new(patient_params)
    if patient.save
---
INSERT INTO "patients" ("first_name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["first_name", "Pat 001"], ["created_at", "2023-11-18 06:10:34.040896"], ["updated_at", "2023-11-18 06:10:34.040896"]]

  def update
    if @patient.update(patient_params)
---
UPDATE "patients" SET "last_name" = $1, "updated_at" = $2 WHERE "patients"."id" = $3  [["last_name", "last_name"], ["updated_at", "2023-11-18 06:14:05.169059"], ["id", 1]]

  def set_patient
    @patient = Patient.find(params[:id])
---
SELECT "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]