app/controllers/api/users_controller.rb

INSERT INTO "users" ("email", "created_at", "updated_at", "confirmation_token", "confirmation_sent_at", "role_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    user = User.new(user_params.merge(skip_password_validation: true))
    if user.save